:SETUP:
#+TITLE: Problem Sets and Related Material for ARE 241
#+AUTHOR: Ethan Ligon
#+EMAIL: ligon@berkeley.edu
#+OPTIONS: texht:t toc:nil ':t
#+LATEX_CLASS_OPTIONS: [12pt,letterpaper]
#+LATEX_HEADER: \newcommand{\T}{\top}
#+LATEX_HEADER: \newcommand{\E}{\ensuremath{\mbox{E}}}
#+LATEX_HEADER: \newcommand{\R}{\ensuremath{\mathbb{R}}}
#+LATEX_HEADER: \newcommand{\Cov}{\ensuremath{\mbox{Cov}}}
#+LATEX_HEADER: \newcommand{\Eq}[1]{(\ref{eq:#1})}
#+LATEX_HEADER: \usepackage{bbm}\newcommand{\one}{\mathbbm{1}}
#+LATEX_HEADER: \newtheorem{proposition}{Proposition} \newcommand{\Prop}[1]{Proposition \ref{prop:#1}}
#+LATEX_HEADER: \newtheorem{theorem}{Theorem} \newcommand{\Thm}[1]{Theorem \ref{thm:#1}}
#+LATEX_HEADER: \newtheorem{corollary}{Corollary} \newcommand{\Cor}[1]{Corollary \ref{cor:#1}}
#+LATEX_HEADER: \newtheorem{remark}{Remark} \newcommand{\Rem}[1]{Remark \ref{rem:#1}}
#+LATEX_HEADER: \newtheorem{condition}{Condition} \newcommand{\Cond}[1]{Condition \ref{cond:#1}}
#+LATEX_HEADER: \newtheorem{lemma}{Lemma} \newcommand{\Lem}[1]{Lemma \ref{lem:#1}}
#+LATEX_HEADER: \newtheorem{assumption}{Assumption} \newcommand{\Ass}[1]{Assumption \ref{ass:#1}}
#+LATEX_HEADER: \newcommand{\Fig}[1]{Figure \ref{fig:#1}} \newcommand{\Tab}[1]{Table \ref{tab:#1}}
#+LATEX_HEADER: \addbibresource{main.bib}\renewcommand{\refname}{}
#+LATEX_HEADER: \addbibresource{ligon.bib}
#+LATEX_HEADER: \usepackage{stringstrings}\renewcommand{\cite}[1]{\caselower[q]{#1}\citet{\thestring}}
#+BIBLIOGRAPHY: main chicago
#+PROPERTY: header-args:python :results output :noweb no-export :exports none :prologue (format "# Tangled from %s on %s" (buffer-file-name) (current-time-string))
:END:

*** Heady et al (1955)
 #+BEGIN_SRC python :python /usr/bin/python3.5 :results output :export both :tangle /tmp/foo.py
 # rpy2 now requires python3
 from rpy2.robjects.packages import importr
 from rpy2.robjects import r, pandas2ri

 pandas2ri.activate()

 foo = importr('agridat') # See https://www.rdocumentation.org/packages/agridat/versions/1.12

 r.data('heady.fertilizer')
 df = r['heady.fertilizer'].query("crop=='corn' and rep==1")

 print(df[['P','K','N','yield']].dropna().to_string(index=False))
 df[['P','K','N','yield']].dropna().to_csv('/tmp/heady-etal55.csv')
 #print (df[['yield']]==0).count()
 #+END_SRC

 #+results:
 #+begin_example
 P  K    N  yield
   0  0    0   24.5
  40  0    0   26.7
  80  0    0   22.1
 120  0    0   44.2
 160  0    0   12.0
 200  0    0   37.7
 240  0    0   38.0
 280  0    0   32.4
 320  0    0    5.3
   0  0   40   23.9
  40  0   40   60.2
 160  0   40   96.2
 200  0   40   81.1
 320  0   40   79.5
   0  0   80   28.7
  80  0   80   99.5
 160  0   80  102.2
 240  0   80   97.2
 320  0   80  116.9
   0  0  120   25.1
 120  0  120  119.4
 160  0  120  133.3
 280  0  120  129.5
 320  0  120  135.7
   0  0  160   17.3
  40  0  160   96.0
  80  0  160  115.9
 120  0  160  113.6
 160  0  160  129.7
 200  0  160  128.7
 240  0  160  127.6
 280  0  160  134.4
 320  0  160  122.9
   0  0  200    7.3
  40  0  200   95.4
 160  0  200  105.7
 200  0  200  140.3
 320  0  200  138.7
   0  0  240   16.2
  80  0  240  112.4
 160  0  240  130.5
 240  0  240  121.1
 320  0  240  127.3
   0  0  280   26.8
 120  0  280  114.9
 160  0  280  123.6
 280  0  280  130.0
 320  0  280  131.8
   0  0  320   25.1
  40  0  320   81.9
  80  0  320  129.0
 120  0  320  124.6
 160  0  320  135.6
 200  0  320  136.0
 240  0  320  130.9
 280  0  320  124.8
 320  0  320  127.9
#+end_example

